app/models/shortened_url.rb

SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "waPAK1qyxpuRHMsxH7ULHg"], ["LIMIT", 1]]
---
  def self.random_code
    string = SecureRandom.urlsafe_base64
    while self.exists?(:short_url => string)

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.twitter.com"], ["short_url", "HEQLb0B0Z4G7dwvrBIP3Pg"], ["user_id", 1], ["created_at", "2021-04-29 20:59:47.299621"], ["updated_at", "2021-04-29 20:59:47.299621"]]
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.gmail.com"], ["short_url", "6ph_W4ZotVLsL7In0rKkBQ"], ["user_id", 4], ["created_at", "2021-04-30 17:53:43.705465"], ["updated_at", "2021-04-30 17:53:43.705465"]]
---
  def self.create_for_user_and_long_url!(user, long_url)
    ShortenedUrl.create!(user_id: user.id, long_url: long_url, short_url: random_code)

SELECT COUNT("shortened_urls"."id") FROM "shortened_urls" WHERE (user_id = 4 and created_at >= '2021-04-30 17:51:09.930835')
---
  def num_recent_uniques
    Visit.select(:user_id)
         .distinct
         .where(["shortened_url_id = ? and created_at >= ?", self.id, 10.minutes.ago])
         .count